<template>
  <div class="help">
    <div class="container">
      <div class="help__inner inner--header">
        <div class="title">
          <span class="title__number">04</span>
          <div class="title__content">
            <p>Помощь</p>
            <div class="title__progress">
              <span></span>
              <span></span>
            </div>
          </div>
        </div>
        <p class="help__text">Здесь представлены ответы на самые часто задаваемые вопросы</p>
        <Accordion :accordion-items="items"/>
      </div>
    </div>
  </div>
</template>

<script>
import AccordionIcon from "@/icons/AccordionIcon.vue";
import Accordion from "@/components/Accordion.vue";

export default {
  name: "SectionHelp",
  components: {Accordion, AccordionIcon},
  data() {
    return {
      items: [
        {
          id: 1,
          title: "Какие документы мне необходимы для регистрации фирмы?",
          answer: "Для регистрации фирмы обычно требуется следующий набор документов: копия паспорта учредителей, устав компании, документы, подтверждающие адрес регистрации компании, а также заполненные и подписанные регистрационные формы. Однако, требования могут различаться в зависимости от юрисдикции, в которой вы планируете зарегистрировать фирму. Рекомендуется обратиться к юристу или специалисту по регистрации компаний для получения точной информации.",
          subItems: [
            {
              id: 1.1,
              title: 'Для регистрации фирмы ООО',
              answer: 'Вам нужно - заявление на регистрацию, устав, решение единственного учредителя, протокол собрания учредителей, договор о создании ООО и квитанция об оплате пошлины'
            },
            {
              id: 1.2,
              title: 'Прикол',
              answer: 'Прикол тот еще'
            },
          ],
        },
        {
          id: 2,
          title: "Какой срок рассмотрения моего дела в суде?",
          answer: "Сроки рассмотрения дел в суде могут значительно различаться в зависимости от типа дела, сложности ситуации, нагрузки на суд и других факторов. Обычно судебные процессы занимают несколько месяцев, однако некоторые сложные дела могут растянуться на годы. Важно помнить, что каждое дело уникально, и конкретный срок рассмотрения будет определяться судом в процессе его рассмотрения.",
          subItems: [],
        },
        {
          id: 3,
          title: "Какие требования необходимо соблюсти при покупке недвижимости?",
          answer: "При покупке недвижимости необходимо учитывать следующие требования: провести юридическую проверку объекта недвижимости, составить и подписать договор купли-продажи, зарегистрировать сделку в соответствующем реестре недвижимости, уплатить соответствующие налоги и сборы, а также соблюдать все требования, установленные законодательством вашей страны или региона.",
          subItems: [
            {
              id: 3.1,
              title: 'Документы для суда в форме обращения АМС форума',
              answer: 'Прикол тот еще'
            },
          ],
        },
        {
          id: 4,
          title: "Каковы последствия нарушения авторских прав?",
          answer: "Нарушение авторских прав может иметь серьезные последствия. Автор или правообладатель имеет право на защиту своих прав путем обращения в суд и требования компенсации за ущерб, причиненный нарушением. В случае признания нарушения, нарушитель может быть обязан выплатить штраф, возместить убытки и прекратить использование нарушающего материала.",
          subItems: [],
        },
      ],
    };
  }
};
</script>

<style scoped>

.title {
  margin-bottom: 70px;
}

.help__text {
  max-width: 1000px;
  font-style: normal;
  font-weight: 700;
  font-size: 34px;
  line-height: 1.3;
  color: var(--blue-secondary-);
  margin-bottom: 60px;
}

@media (max-width: 1200px) {
  .help__text {
    font-size: 28px;
  }
}

@media (max-width: 992px) {
  .help__text {
    font-size: 24px;
    max-width: 500px;
  }
}

@media (max-width: 768px) {
  .title {
    margin-bottom: 50px;
  }

  .help__text {
    font-size: 22px;
  }
}

@media (max-width: 600px) {
  .help__text {
    font-size: 20px;
  }
}

@media (max-width: 468px) {
  .help__text {
    font-size: 18px;
  }
}
</style>